-- СТВОРЕННЯ ТАБЛИЦІ 

-- CREATE TABLE ANIMALS (
-- 	-- SERIAL -- ЧИСЛО АТОМАТИЧНО ЗБІЛЬШУЕТЬСЯ НА 1 
-- 	-- PRIMARY KEY -- ВКАЗУЄМО ЩО ДАННИЙ СТОВПЧИК ЦУ УНІКАЛЬНА АЙДИ(ПЕРВИННИЙ КЛЮЧ)
-- 	ANIMAL_ID SERIAL PRIMARY KEY,
-- 	-- НАЗВА СТОВЧИКІВ ТА ЇХ ТИП ДАННИХ 
-- 	BREED VARCHAR(20), -- TYPE TEXT NOT MORE THEN 20 SYMBOLS 
-- 	AGE INT,
-- 	COLOR VARCHAR(40)
-- );

-- -- ДОБАВИТИ ДАННІ В ТАБЛИЦЮ
-- INSERT INTO ANIMALS(
-- 	--ПЕРЕРАХУНО СТОВПЧИКІВ ЯКІ ВИ ДОБАВИТЕ
-- 	BREED,
-- 	AGE,
-- 	COLOR
-- )
-- VALUES
-- 	('КІТ', 2, 'РУДИЙ'),
-- 	('ПЕС', 6, 'СІРИЙ')

INSERT INTO ANIMALS (
BREED, AGE, COLOR
) 

VALUES
('Кіт', 2, 'Сірий'),
('Пес', 5, 'Коричневий'),
('Хом''як', 1, 'Білий'),
('Кіт', 3, 'Чорний'),
('Пес', 4, 'Чорно-білий'),
('Хом''як', 2, 'Сірий'),
('Кіт', 1, 'Рудий'),
('Пес', 6, 'Сірий'),
('Хом''як', 1, 'Рудий'),
('Кіт', 4, 'Білий'),
('Пес', 2, 'Рудий'),
('Хом''як', 3, 'Чорний'),
('Кіт', 5, 'Сірий'),
('Пес', 3, 'Білий'),
('Хом''як', 2, 'Чорно-білий'),
('Кіт', 2, 'Чорний'),
('Пес', 1, 'Сірий'),
('Хом''як', 1, 'Рудий'),
('Кіт', 3, 'Білий'),
('Пес', 4, 'Чорний'),
('Хом''як', 2, 'Сірий'),
('Кіт', 1, 'Чорно-білий'),
('Пес', 5, 'Рудий'),
('Хом''як', 3, 'Білий'),
('Кіт', 2, 'Сірий'),
('Пес', 2, 'Чорно-білий'),
('Хом''як', 1, 'Чорний'),
('Кіт', 4, 'Рудий'),
('Пес', 3, 'Білий'),
('Хом''як', 2, 'Сірий');

--ЗАПИТИ 
--ОТРИМАТИ ВСЮ ТАБЛИЦЮ 
SELECT *  --СТОВПЧИКИ ЯКІ ПОЗАКАТИ ЯКЩО ПОКАЗАТИ ТРЕБА ВСІ -- *
FROM ANIMALS ;

--ОТРИМАТИ ЛИШЕ BREED AGE 
SELECT BREED,AGE 
FROM ANIMALS;

-- ОТРИМАТИ СТОВПЧИК BREED, BUT ONLY UNIQUE DATA 
SELECT DISTINCT BREED 
FROM ANIMALS;

--- ВИВЕСТИ ЛИШЕ КОТІВ 
SELECT * 
FROM ANIMALS
WHERE BREED = 'Кіт';

---ОТРИМАТИ ТВАРИН МОЛОДШИХ ЗА 2 РОКИ 
SELECT *
FROM ANIMALS 
WHERE AGE <= 2;
