# 🧩 Рівень 1 — базові навички
#
# Напишіть програму, яка приймає від користувача число n і виводить усі числа від 1 до n, що діляться на 3.
n = 10

for i in range(1, n + 1):
    if i % 3 == 0:
        print(i)


#
# Напишіть програму, яка приймає два рядки і виводить найдовший з них.
string1 = 'hey.how are you feeling today?'
string2 = 'hey.how are you?'

if len(string1) > len(string2):
    print('string1 is longer')
else:
    print('string2 is longer')

#
# Напишіть програму, яка приймає рядок і підраховує кількість голосних літер (a, e, i, o, u або українські а, е, і, о, у, я, ю, є, ї).
counter = 0
for letter in string1:
    if letter in 'aeiouAEIOU':
        counter += 1
print(counter)



#
# Напишіть програму, яка обчислює факторіал числа, введеного користувачем.
#






# Напишіть програму, яка перевіряє, чи є введене число парним і кратним 5 одночасно.
#
# 🧠 Рівень 2 — списки, умови, цикли
#
# Напишіть програму, яка створює список з 10 випадкових чисел і виводить:
#
# мінімальне,
#
# максимальне,
#
# середнє значення.
#
# Напишіть програму, яка видаляє всі повтори зі списку (залишає лише унікальні елементи).
#
# Напишіть програму, яка приймає список чисел і створює новий список, що містить лише числа, більші за 10.
#
# Напишіть програму, яка приймає список рядків і виводить найдовший рядок.
#
# Напишіть програму, яка приймає від користувача слово і створює словник, де ключами є літери, а значеннями — кількість їх появ у слові.
#
# ⚙️ Рівень 3 — функції
#
# Напишіть функцію, яка приймає число і повертає True, якщо воно є простим.





#
# Напишіть функцію multiply_list(numbers), яка повертає добуток усіх чисел у списку.
#
# Напишіть функцію reverse_string(text), яка повертає рядок у зворотному порядку.
#
# Напишіть функцію, яка приймає два списки і повертає новий список, що містить лише спільні елементи.
#
# Напишіть функцію, яка приймає список чисел і повертає кортеж: (кількість парних, кількість непарних).
#
# 💎 Рівень 4 — на “кристалики”
#
# Напишіть програму, яка зберігає інформацію про книги у словнику (назва → автор).
# Дозвольте користувачу:
#
# додавати нову книгу,
#
# видаляти книгу,
#
# шукати книгу за назвою.
#
# Напишіть функцію, яка приймає список кортежів студентів у форматі
# [(ім’я, оцінка), (ім’я, оцінка), …]
# і повертає список імен студентів, у яких оцінка вища за 90.
#
# Напишіть програму, яка приймає рядок і створює словник, у якому ключі — це слова, а значення — довжина кожного слова.
#
# Напишіть програму, яка приймає список чисел і за допомогою lambda та filter створює новий список лише з непарних чисел.
#
# Напишіть вираз із lambda і sorted, який сортує список словників за полем 'age', наприклад: